load.yml
config:
  target: https://bubblemart-backend.onrender.com/v1
  # phases:
  #   - duration: 20
  #     arrivalRate: 5
  #     name: Startup phase
  #   - duration: 5
  #     arrivalRate: 20
  #     name: Peak phase
  #   - duration: 10
  #     arrivalRate: 2
  #     name: Slow-down phase
  # phases:
  #   - duration: 30
  #     arrivalRate: 100
  #     name: Ramp-up phase
  #   - duration: 30
  #     arrivalRate: 200
  #     name: Peak phase
  #   - duration: 20
  #     arrivalRate: 50
  #     name: Cool-down phase
  phases:
    - duration: 1 
      arrivalRate: 60
  http:
    headers:
      Origin: "https://bubblemart.shop"
  plugins:
    ensure:
        thresholds:
          - http.response_time.max: 1000
    expect: {}
scenarios:
  - flow:
    - get:
        url: "/product"
        headers:
          Origin: "https://bubblemart.shop"
        expect:
          - statusCode: 200