load.yml
config:
  target: https://bubblemart-backend-dgtv.onrender.com/v1
  # phases:
  #   - duration: 20
  #     arrivalRate: 5
  #     name: Startup phase
  #   - duration: 5
  #     arrivalRate: 20
  #     name: Peak phase
  #   - duration: 10
  #     arrivalRate: 2
  #     name: Slow-down phase
  # phases:
  #   - duration: 30
  #     arrivalRate: 100
  #     name: Ramp-up phase
  #   - duration: 30
  #     arrivalRate: 200
  #     name: Peak phase
  #   - duration: 20
  #     arrivalRate: 50
  #     name: Cool-down phase
  # phases:
  #   - duration: 1 
  #     arrivalRate: 60
  phases:
    - duration: 60  # Run the test for 60 seconds
      arrivalRate: 10  # Start with 5 new requests per second
      # rampTo: 20  # Increase gradually to 20 requests per second
  processor: "./ip-rotate.js"

  http:
    # localAddress: "{{ ip }}"  # Bind request to different IPs

    headers:
      Origin: "https://bubblemart.shop"
      X-Forwarded-For: "{{ ip }}"
  plugins:
    ensure:
        thresholds:
          - http.response_time.max: 1000
    expect: {}
scenarios:
  - flow:
    - function: "setRandomIP"
    - get:
        url: "/product"
        headers:
          Origin: "https://bubblemart.shop"
          X-Forwarded-For: "{{ ip }}"
        expect:
          - statusCode: 200